app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 4]]
---
  def index
    if params[:artist_id]
     artist = Artist.find_by(id: params[:artist_id])
     if artist.nil?
       flash[:alert] = "Artist not found."
       redirect_to artists_path
     else
       @songs = artist.songs
     end
   else
     @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    if params[:artist_id]
    @artist = Artist.find_by(id: params[:artist_id])
    if @artist.nil?
      redirect_to artists_path
    else
      @song = @artist.songs.find_by(id: params[:id])